In [8]:
import pandas as pd
import numpy as np
#pd.set_option('display.height', 1000)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

In [9]:
data = pd.read_csv(#csv)

In [10]:
data.head()

   ateniese@sbcglobal.net    6. kourai@live.com    goldberg@mac.com
0        goldberg@mac.com    7. bancboy@msn.com     farber@yahoo.ca
1         farber@yahoo.ca  8. mstrout@gmail.com      comdig@att.net
2          comdig@att.net     9. tromey@mac.com      comdig@att.net
3          comdig@att.net                   NaN  6. kourai@live.com
4      6. kourai@live.com                   NaN  7. bancboy@msn.com

In [11]:
data_dict = {}
#x = however many columns of values there are 
for i in range(x):
    for val in data.iloc[:,i].unique():
        if val in data_dict:
            data_dict[val] = data_dict[val] + 1
        else:
            data_dict[val] = 1

In [12]:
#unpack dictionary to put into new df
keys,values = data_dict.keys(),data_dict.values()
keys = list(keys)
values = list(values)

In [13]:
pd.DataFrame({'keys':keys, 'values':values})

                     keys  values
0        goldberg@mac.com       1
1         farber@yahoo.ca       2
2          comdig@att.net       2
3      6. kourai@live.com       2
4      7. bancboy@msn.com       3
5    8. mstrout@gmail.com       2
6       9. tromey@mac.com       2
7     10. cameron@att.net       1
8   11. kramulous@att.net       1
9   12. granboul@live.com       1
10                    NaN       2